[M_Sage_Raid MissionDefinition]
MissionDescription="There is a really, really big Stalker somewhere in Aegrus and, like all really, really big things on Pandora, it needs to be killed. Are you and your friends up to the task?<br><br>An Aegran warlock named Chief Ngwatu has found, and managed to control, a powerful creature named Voracidous. It's unclear where it came from or how the Chief is controlling, but the Savage Murderers believe it's a god. They consider Chief Ngwatu a heretic for attempting to control their deity, and they've made it their goal to kill Ngwatu and unleash Voracidous's true power."
TeaserText="It's dangerous to go alone. Seriously."
